In [1]:
import pandas as pd
import numpy as np

In [5]:
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [7]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1,inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [8]:
target=df.Survived

In [14]:
inputs=df.drop('Survived',axis=1)

In [15]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [16]:
inputs=pd.concat([inputs,dummies],axis=1)
inputs

     Pclass     Sex   Age     Fare  female  male
0         3    male  22.0   7.2500       0     1
1         1  female  38.0  71.2833       1     0
2         3  female  26.0   7.9250       1     0
3         1  female  35.0  53.1000       1     0
4         3    male  35.0   8.0500       0     1
..      ...     ...   ...      ...     ...   ...
886       2    male  27.0  13.0000       0     1
887       1  female  19.0  30.0000       1     0
888       3  female   NaN  23.4500       1     0
889       1    male  26.0  30.0000       0     1
890       3    male  32.0   7.7500       0     1

[891 rows x 6 columns]

In [17]:
inputs.drop('Sex',axis=1,inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [19]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [20]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [21]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [42]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [43]:
len(X_train)

712

In [44]:
len(X_test)

179

In [45]:
len(inputs)

891

In [46]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [47]:
model.fit(X_train,y_train)

GaussianNB()

In [48]:
model.score(X_test,y_test)

0.8156424581005587

In [49]:
X_test[:10]

     Pclass        Age     Fare  female  male
580       2  25.000000  30.0000       1     0
882       3  22.000000  10.5167       1     0
329       1  16.000000  57.9792       1     0
605       3  36.000000  15.5500       0     1
567       3  29.000000  21.0750       1     0
449       1  52.000000  30.5000       0     1
6         1  54.000000  51.8625       0     1
321       3  27.000000   7.8958       0     1
582       2  54.000000  26.0000       0     1
468       3  29.699118   7.7250       0     1

In [50]:
y_test[:10]

580    1
882    0
329    1
605    0
567    0
449    1
6      0
321    0
582    0
468    0
Name: Survived, dtype: int64

model.predict(X_test[::10])

In [51]:
model.predict(X_test[::10])

array([1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0], dtype=int64)

In [52]:
model.predict_proba(X_test[:10])

array([[0.03157983, 0.96842017],
       [0.07179405, 0.92820595],
       [0.00400108, 0.99599892],
       [0.98939921, 0.01060079],
       [0.07866819, 0.92133181],
       [0.89990293, 0.10009707],
       [0.85700288, 0.14299712],
       [0.98831887, 0.01168113],
       [0.97266886, 0.02733114],
       [0.98869097, 0.01130903]])